# 어제 학교 앞에서 Julka는 다음 퍼즐을 풀고 교사 Ro를 놀라게 합니다.

# Klaudia와 Natalia는 함께 사과 10개를 가지고 있지만 Klaudia는 Natalia보다 2개 더 많은 사과를 가지고 있습니다.
# Julka는 namyswu를 넘어 책임이 있습니다. Klaudia에는 ​​6개의 사과가 있고 Natalia에는 4개의 사과가 있습니다.

# 튜터는 스패디나 답을 하기로 결정하고, Julki는 우발적이지 않고 수수께끼를 반복하고, 더미의 수를 늘려서 매번 숫자를 늘립니다. Julka는 항상 올바르게 대답했습니다. -zvi zagzzzzagadki. 숙녀를 무릎 꿇고 도와주는 프로그램을 작성하십시오. 그녀의 솔루션을 연결합니다.

# 다음을 수행하는 프로그램 작성:

# (표준 입력에서) 두 소녀가 가지고 있는 사과 수를 읽고 Klaudia에는 ​​더 많은 사과가 있습니다.
# 그녀는 Klaudia에는 ​​jabweek가 없고 Natalia에는 jabweek가 없다고 계산할 것입니다.
# 결과를 씁니다(표준 출력에).
# 출력 :
# 당신의 프로그램은 (표준 출력에) 두 개의 연속적인 줄에 한 줄에 하나씩 두 개의 정수를 써야 합니다. 첫 번째 줄에는 Claudia의 사과 개수가 포함되어야 하고 두 번째 줄에는 Natalia의 사과 개수가 포함되어야 합니다. 소녀들은 항상 전체 사과를 가지고 있는 것으로 알려져 있습니다.
a = int(input()) # Claudia의 사과
b = int(input()) # Natalia의 사과
print((a+b)//2,(a-b)//2,sep="\n")